from django.conf import settings

ANSWERS = {
    1: "نه اصلاً در شش ماه گذشته",
    2: 'یکبار در شش ماه گذشته',
    3: 'بیش از یک بار در شش ماه گذشته ولی کمتر از یک بار در ماه',
    4: 'یک بار در ماه',
    5: 'بیش از ماهی یکبار، ولی کمتر از هفته ای یکبار',
    6: 'یک بار در هفته',
    7: 'بیش از یک بار در هفته، ولی کمتر از روزی یکبار',
    8: 'روزی یکبار',
    9: 'بیش از روزی یکبار'
}

HELTH_QUESTIONS = {
    "get_covid_19": "آیا تاکنون به بیماری کرونا (کووید 19) مبتلا شده‌اید؟",
    "get_drug": "آیا در 6 ماه گذشته، سابقه‌ی مصرف دخانیات یا شمروبات الکلی را داشته‌اید؟",
    "mental_disorder": "آیا سابقه‌ی بیماری‌های مربوط به روان یا آسیب مغزی داشته‌اید؟ در صورت بله، چه نوع بیماری یا آسیبی بوده است؟"
}

TERM = " شرایط و مقررات شرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقرراتشرایط و مقررات شرایط و مقررات شرایط و مقررات"

HOW_DO_TASK = {
    "gif": settings.MEDIA_URL + "tutorial.gif",
    "text": "تست بسیار ساده است. تعداد 50 تصویر به ترتیب به شما نشان داده می‌شود. اگر تصویری تکراری نمایش داده شد، کلید را بزنید( کلید space یا ضربه در موبایل) . هر تصویر سه ثانیه به شما نمایش داده می‌شود. زمان واکنش شما ثبت خواهد شد."
}

QUESTION_TEXT = "ما علاقه‌مند هستیم به وسیله‌ی این پرسشنامه، میزان حافظه‌ی روزمره شما را در طی ماه‌های گذشته اندازه‌گیری کنیم، لطفا یکی از گزینه‌های مشخص شده برای هر پرسش را انتخاب کنید ."

TASK_DAY_DURATION = 7